# Categories Item(Built In Category) Property

Source: https://www.revitapidocs.com/2026/562ddcba-8f15-7421-e7a5-6968ccef7b10.htm

---

| Categories Item(Built In Category) Property |
| --- |

Retrieves a category object corresponding to a BuiltInCategory id.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public virtual Category this[
	BuiltInCategory categoryId
] { get; }
```

```
Public Overridable ReadOnly Property Item (
	categoryId As BuiltInCategory
) As Category
	Get
```

```
public:
virtual property Category^ Item[BuiltInCategory categoryId] {
	Category^ get (BuiltInCategory categoryId);
}
```

```
abstract Item : Category with get
override Item : Category with get
```

#### Parameters

categoryId BuiltInCategory

#### Property Value

Category Remarks Unlike the method that obtains categories by name, this routine will obtain
the handle even of built\-in subcategories.
Since 2016 it is advised to use either Category.​​​GetCategory(​Document, ​BuiltIn​Category)
or Category.​​​GetCategory(​Document,​ ElementId)​ from Category class. See Also

#### Reference

Categories Class Item Overload Autodesk.Revit.DB Namespace